Revit 2027 API
FamilyParameter.Formula Property
The formula.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Formula { get; }
Public ReadOnly Property Formula As String
	Get
public:
property String^ Formula {
	String^ get ();
}
member Formula : string with get
Property Value
String
Remarks
Returns null if there is no formula governing this parameter.
See Also
Reference
FamilyParameter Class
Autodesk.Revit.DB Namespace